CutBackgroundPatternId Property
 The id of the FillPatternElement used as the background pattern of faces with this material in cut views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public ElementId CutBackgroundPatternId { get; set; }
Visual Basic
Public Property CutBackgroundPatternId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ CutBackgroundPatternId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 The FillPattern used for a cut pattern must have a 'Drafting' target.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  When setting this property: The element id must represent a valid FillPatternElement. -or- When setting this property: The FillPattern target must be a drafting pattern.
Autodesk.Revit.ExceptionsArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Material Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →